---
type: CustomInitialColor
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# CustomInitialColor

`Autodesk.Revit.DB.Lighting.CustomInitialColor` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CustomInitialColor | — | `` |
| Property | Temperature | 2013 | `public double Temperature { get ; set ; }` |